{"meta":{"title":"Talk about life","subtitle":null,"description":null,"author":"Martin Tao","url":"martintao.top"},"pages":[],"posts":[{"title":"世界没有想象的那么糟","slug":"世界没有想象的那么糟","date":"2019-02-15T06:56:21.000Z","updated":"2019-02-15T06:56:55.689Z","comments":true,"path":"2019/02/15/世界没有想象的那么糟/","link":"","permalink":"martintao.top/2019/02/15/世界没有想象的那么糟/","excerpt":"","text":"世界没有想象的那么糟糕 无头骑士赛尔提救下跳楼少女以后跟他说了这句话。 这句话一直在我脑海中不停的被回放， 我也一直在告诉自己，活下去吧，活下去可能会有好事发生， 或许这句话说的对，世界没有想象的那么糟。 大桥封闭修了两年终于开了， 远处城里的灯光星星点点， 手伸出窗外，整个城市的夜空像一颗气球被我的手划破 以120km/h的速度。 车里放着百年孤寂， 一百年前你不是你我不是我， 一百年后没有你也没有我。 感受到了一种两个人的寂寞。 没有找以前的高中同学聚， 感觉很失落却也有种解脱感。 终于是向摆脱过去走出了第一步， D说只有彻底和过去决裂了，才比较好开始新的生活 我又何尝不想呢。 但真的我想过最轻松的方式是死亡。 过去总会像看不见的影子，反复纠缠， 让人不断回想。 所以D决定了离开，他觉得是我过去的一部分。 悲哀是真的，说我封闭也好，冷漠也好 以前的我已经找不到了， 微博朋友圈都删了干净， 我也想不起来，也不明白，为什么自己会变成这样。 只能告诉自己世界没有那么糟， 但是即便是这样， 糟糕的只是我而已。","categories":[],"tags":[]},{"title":"醉生梦死","slug":"醉生梦死","date":"2019-01-17T03:02:11.000Z","updated":"2019-01-17T03:02:33.596Z","comments":true,"path":"2019/01/17/醉生梦死/","link":"","permalink":"martintao.top/2019/01/17/醉生梦死/","excerpt":"乌龟突然说他女朋友不见了，听到这个消息的我此时一头雾水。不见了？不见了是什么意思？ “就是不见了，手机里的联系方式没了，我也忘了她家的地址。” 我更加摸不着头脑了，这不是你把人家忘了吗？怎么是说她不见了呢。 难不成她侵入了你的手机？ 说不通啊，那你还记得什么？ “我不知道，现在感觉她越来越模糊”，乌龟有点迷茫地说道。 我也觉得很奇怪，这逼是不是被甩了，精神出了问题？","text":"乌龟突然说他女朋友不见了，听到这个消息的我此时一头雾水。不见了？不见了是什么意思？ “就是不见了，手机里的联系方式没了，我也忘了她家的地址。” 我更加摸不着头脑了，这不是你把人家忘了吗？怎么是说她不见了呢。 难不成她侵入了你的手机？ 说不通啊，那你还记得什么？ “我不知道，现在感觉她越来越模糊”，乌龟有点迷茫地说道。 我也觉得很奇怪，这逼是不是被甩了，精神出了问题？ 乌龟是我小时候的玩伴，因为很调皮喜欢在地上爬所以有了这个外号。 后来虽然没怎么念书，但好在家里条件还行，也过的挺潇洒。我记得他女朋友换的挺勤的啊，怎么这次被甩突然来这一出呢？ 我心里泛着嘀咕，嘴上安慰他不要着急，我帮你查查资料。 他回去后我熟练的打开了dota2，几盘游戏之后便把这事不知道忘到哪去了。 晚上十点，朋友喊我去酒吧喝酒，推了半天没推掉，最终还是去了。是个还挺安静的清吧，有个驻唱，唱的也是通俗芭乐。感觉很后悔，为什么答应要来，还不如在家打游戏。 突然听到隔壁桌在聊些有的没的。 “你听过那个酒吧没？” “哪个？” “就是那个，什么混沌酒吧。” “那是什么吊地方？” “听说奥，去那边喝酒的人，第二天其他人就记不得他了。” “吹牛逼波，兄弟你还是小说看多啦？” 听到这我一下子精神了，这不是乌龟那事么。如果真是他们说的这样，那么还真是乌龟说的那样？ 那他女朋友哪里知道的这个什么混沌酒吧呢？ 感觉知道的越多问题反而越多，一时间更头疼了。 而且这也不科学啊，你说你喝个酒忘记别人就算了，这个东西我在东邪西毒里也见过，让别人忘记你是什么意思？ 还想多听听那两兄弟说些什么，结果刚一晃神人就没影了。 卧槽这两人该不会是系统NPC吧，专门来给我发任务的？这线索也太少了，我怎么查？ 打开高德地图一查，还真有个地方叫混沌酒吧，行吧，我佛了。","categories":[],"tags":[]},{"title":"自闭214天","slug":"自闭214天","date":"2018-10-23T07:06:07.000Z","updated":"2018-11-27T09:15:58.584Z","comments":true,"path":"2018/10/23/自闭214天/","link":"","permalink":"martintao.top/2018/10/23/自闭214天/","excerpt":"来上海转眼已经半年多了， 有很多难熬的时候，觉得自己快要撑不下去了， 但时间总是回首看的时候才觉得过的很快 ，身处其中的时候若能加速时间就好了。","text":"来上海转眼已经半年多了， 有很多难熬的时候，觉得自己快要撑不下去了， 但时间总是回首看的时候才觉得过的很快 ，身处其中的时候若能加速时间就好了。 来上海的目的既复杂又纯粹。 纯粹的想逃离南京，南京的很多地方再次看见的时候，都像是被回忆扇了一个耳光。 那时候我想可能换一个环境会好很多吧。 但我很快发现生活圈子换的很容易， 社交圈如果也能这样轻易逃离就好了。 睡的时间越来越晚，从12点到1点，再到后来的三四点。 万幸住的离公司比较近，不用太早起床。 在很多个睡不着的夜里，都想着有什么方法结束人生。 这样是最彻底的一种方式， 不用强迫自己忘记，逃离朋友圈，这些无力的挣扎。 很多时候我都觉得，如果人生是场游戏，那我的这份存档已经算失败了， 后面再玩下去也没什么意义，删档是最直接的一种方式。 于是每次想到这些我都会心跳加速，很兴奋， 有种知道自己快解脱了的那种期待。 住的离海边比较近，所以第一考虑是跳海。 虽然会点蛙泳，不过在有浪的情况应该也能顺利结束。 还想过绑块大石头在身上，这样应该最保险。 我想象自己一步步往海里走去，夜色下海面星星点点，很舒服。 同时盘算着自己的遗产怎么分配， 虽然也没钱，但还有些东西能用的值得送给朋友们。 于是经常想着想着天亮了。 后来有一次做梦梦到自己往海里走去， 醒来的时候很失落，比梦到自己中了五百万还要失落， 跟W说起这事，他有点担心，我意识到这样是会给人困扰， 于是以后不再跟人提起，只是自己默默做着打算。 死前还有哪些事情要做，一步步的开始慢慢完成。 我的自律性很差，以前很少订计划，订了也鲜有完成过。 这种向死而生的活法，好像还稍微变得自律了一点。 上周末看了《一个叫欧维的男人决定去死》， 剧中有几种自杀方式参考了下觉得都不太可行。 上吊 没有这个条件 车尾气 挪威的森林里有这种死法，我觉得这个要配合安眠药使用。主要原因我没车。 于是现在暂定的还是跳海吧。 希望能在2020年前把手头的麻烦的事情做完。 我今年24岁（虚25），这是我自闭的第214天。 以上。","categories":[],"tags":[]},{"title":"牡丹江路","slug":"牡丹江路","date":"2018-07-31T07:53:04.000Z","updated":"2018-07-31T07:55:38.487Z","comments":true,"path":"2018/07/31/牡丹江路/","link":"","permalink":"martintao.top/2018/07/31/牡丹江路/","excerpt":"","text":"下午去银行路过牡丹江路，两边的梧桐树茂密了，树荫正好遮住双向四车道。 骑车感受到风吹短袖里穿过，右手边公园里有人在打羽毛球。也有老人坐在长椅上吹水。 想到了阳光灿烂的日子，马小军尾形宁静的那条路，可是我到这个场景的时候远离青春已经五年了。 二十岁的时候冒雨去当时女友家，也是夏天，雨很大，从头到脚湿的凉凉的，裤子口袋里的索尼手机进水关机了。 到了她家门口碰上她拿了两把伞正要出门接我，意外看到变成水鬼的我。 当时那样子肯定说不上帅吧，淋了雨还帅的印象中只有重庆森林里的金城武。 但她还是紧紧抱住了我，后来我每想到20岁的自己，就只记得那天的雨。 湿淋淋的自己，还有记忆里已经面容模糊的她。 南京的夏天印象最深的就是路边的梧桐，学名悬铃木，这个名字比较好听。 贯穿市中心的中山路上尤其多，再早些上高中的时候周日返校总会从那路过。 书包里装着刚从军人俱乐部里淘来的书，想着未来的自己会在哪，做些什么，和谁在一起。 数着路灯上的号码牌，中山北路192号路灯便是终点。 以后每次路过鼓楼都会看下那个路灯的方位，仿佛就像穿过时间看到了以前的自己。可 能有点不太公平，我能看到他，他对我却只能完全靠想象。 不过也是好事，看到我这个样子，可能也失去了活下去的勇气了。 有时候总是会忍不住想要回忆些什么，特别是年纪越大，这个毛病就越严重。 所以总会避免去翻相册，甚至也懒得整理，把以前的记录都删了干净， 一些仍然舍不得放不下的就注销账号不去理他。 增加了回忆的成本，自然也就避免了沉湎其中。 事实上很多事情还都在记忆里，而且总会通过莫名其妙的联想进入现在的时间，或者是以梦境的方式，这些都不可控，不禁怀疑是不是那时候的人通过这种方式来窥探未来。 可能这就是为什么总会有莫名其妙的即视感，明明第一次看到的场景却感觉以前经历过。 想把记忆都装进凤梨罐头，定时过期，所有好的不好的，放进回收站一键删除。 这样会不会少点睡眠问题，如果是的话，恐怕凤梨罐头会脱销吧。","categories":[],"tags":[]},{"title":"过云雨","slug":"过云雨","date":"2018-07-31T07:45:00.000Z","updated":"2018-07-31T07:55:42.232Z","comments":true,"path":"2018/07/31/过云雨/","link":"","permalink":"martintao.top/2018/07/31/过云雨/","excerpt":"","text":"到惠州的时候是下午，公交车开了很久到了郊区陆续能看到很多厂房，天气很热听不到蝉鸣。 印象中的热带气候是淅淅沥沥的雨，是阿飞正传里的结尾，阿飞坐着火车看着窗外雨打在椰子树上，空气中永远氤氲着水汽。 但惠州并不是，确切的说是塘下区并非这样。 宿舍楼走廊上往远处看，有座一直弥漫着雾气的山，跟夏天的紫金山差不多绿。 休息日的时候常看着山发呆，在断了一切社交的情况下也只能如此打发时间。 M有时候会找我聊天，那天我们线没完成指标，组长罚我们晚上不去加班。 因为正常是要加班的，而且晚上工资是1.5倍，所以不加班反而是种惩罚。我跟M有一搭没一搭的聊着，太阳下山以后很凉快，潮湿的空气仿佛凝滞了时间。 M是客家人，普通话不是很好，但她却是师范专业的，所以觉得靠普通话资格证很痛苦，并说很羡慕我普通话说的好。在我二十年的人生中，第一次被羡慕的理由，是因为普通话说的好。 后来回去后每天念一段文录给他，章节基本是当时在看的书，王小波卡尔维诺之类，直到她考到了二甲。 可能跟我也没什么关系，因为自己读课文实在太差了，从小便是这样。 毫无预兆的就下雨了，一开始还不习惯，被淋了几次以后养成了随手带伞的习惯。 每次都只下一会，像是上帝恶作剧打开了水龙头。H发消息来说没带伞，我拿了多余的伞给她送去。 去流水线的路上有条很长的直道，右边便是工厂的高墙。 墙上的玻璃渣上爬满了藤蔓植物，像是给这个防御工事加了buff。每次路过这都觉得有种异样的美感，彩色的花和锋利的玻璃，想起来了，是暴力美学。 H跟我一届，因为想换个手机便来当暑假工。每天的盼头就是算下工资，离手机还差多少钱。 那时候两三千块就能买个不错的手机，但是她想买个iphone，需要一周上班72小时，一个半月才能攒够钱。 九点半下晚班，在门口的传达室找到H，请我去对面小店吃了碗肠粉，吃完我说道，两碗肠粉你一小时白干了。 她用客家话说么斯么斯，这也是她教我说的第二句客家话，没事没事。第一句是她的名字。 如今想起这些很多事情都忘记了，只记得这些琐碎细小的事，后来跟当时的朋友也渐渐断了联系。 人总是这样，像一只无脚鸟不停的飞，认识，遗忘，再认识新的人。春夏秋冬，有多少人会走；春夏秋冬，有多少人会留","categories":[],"tags":[]},{"title":"夏天结束了","slug":"夏天结束了","date":"2018-07-30T13:26:51.000Z","updated":"2018-07-30T13:56:49.469Z","comments":true,"path":"2018/07/30/夏天结束了/","link":"","permalink":"martintao.top/2018/07/30/夏天结束了/","excerpt":"","text":"一下高铁就感受到武汉的夏天，一看手机，38度，总感觉以前的夏天没这么热，要不然怎么能在没空调的宿舍里待下去的。 当然也有可能是因为暑假不在武汉，那年暑假在学校写代码好像也是有这么热的。 学校里的夏天一直都是傍晚，黄昏之时学校里的人才多了起来。 五点半广播台的节目开场音乐是一段纯音乐旋律，毕业以后才知道那首歌是《你离开了南京，从此没有人跟我说话》（@版权斗士李志）。 下楼走过操场去后街，记得刚来学校的时候，在路上抓住一个人问后街怎么走，他说跟着人潮走就到了。 在这个时间段出门的人都是去后街的，现在想起来还是觉得这个指路很妙。 路灯亮了，照在行道树上反射出火树银花的效果。操场上的人也多了起来，用熙熙攘攘形容也不夸张。 夏天天亮的很早，记得有一次很早去操场，一圈一圈漫无目的的走着，耳机里单曲循环《搁浅》。 后来每次听到搁浅都会想到那个时候，是第一次失恋的时候。 当时的感觉已经忘了，想起来也是空白一片。 以前会有那种信心，某种感觉会一辈子记得，但可能是经历的事情一多，就变得迟钝麻木起来。 情景还历历在目，感觉却越来越模糊。 就像毕业的夏天喝了很多酒，每天都是吃不完的散伙饭，当时的人和事还记得，是一种什么样的感情越也已经忘了，到现在也不过才两年而已。 去年回武汉的时候是三月份生日，时隔一年再回来没有陌生的感觉，好像什么都没变。 光谷还是在修那个圆盘，地铁没有不挤的时候，以及民族大道永远在堵车。 吃完饭回酒店，走在关山大道上，旁边的轨道电车开的还没自行车快。 Z新交了男朋友，但说只是将就；A在武汉买了房，天天还是吊儿郎当的样子；D过年就要结婚了，喊我们去孝感参加婚礼。 这时候感觉很多东西又变了，突然觉得很没有意思，很多时候在想为了什么活着，当然都想不明白。 邹说我活着就是为了抽烟，我想这样说也说得通。 临行的前一晚酒店停电了，我们三个人坐在汉口站门前广场上抽烟。看形形色色的人往天南海北走去。 以前最喜欢的歌词是，你问我要去向何方，我指着大海的方向。 后来抽了那么多烟都没找到大海在哪，始终不明白，不明白。 —-夏天三部曲end","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2018-07-30T08:32:40.694Z","updated":"2018-07-30T08:32:40.694Z","comments":true,"path":"2018/07/30/hello-world/","link":"","permalink":"martintao.top/2018/07/30/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}